<template>
  <div class="notification is-success">
    <p>Архитектор запущен в начале января, и дальше будет как-то постепенно развиваться. Есть планы подключить
      Stable
      Diffusion 2.1, может это даст какие-то иные результаты. Есть желание подключить ChatGPT, но пока непонятно как
      и
      зачем.</p>

    <p>Хотелось бы еще добавить систему, которая будет давать картинам осмысленные названия. Это могло бы добавить
      понимания, что рисуется в некоторых работах.</p>
  </div>
</template>
