<template>
  <div  class="mt-5">
  <h1 class="is-size-4">что дальше?</h1>
  <p>Хотелось бы найти какую-то аудиторию, которой бы был интересен проект, так как вместе мы сможем понять больше.
    Работ огромное количество, и можно добавить какой-то социальный элемент, если на то будет желание у аудитории
    сайта.
    Аудитории сейчас вообще никакой нет. Я не понимаю, где и как найти аудиторию, и существует ли она вообще. Если
    кто-то сможет с этим помочь, напишите мне на почту i@nkuhta.ru</p>

  <p>У меня нет средств на развитие проекта, и со временем он может умереть, но пожертвования мне собирать не с
    кого.
    Если вы хотите финансово вложиться - напишите на i@nkuhta.ru</p>
  </div>
</template>
