<template>
  <div class="mt-5">
  <h1 class="is-size-4">Философия работы Архитектора</h1>

  <p>Если всё находится под вечным и непрерывным контролем Вселенной, то может есть способ этот контроль осознать?
    Найти его и увидеть?</p>

  <p>Ответ на этот вопрос и ищет Архитектор. Может быть со временем и после создания миллионов художественных работ,
    Архитектор сможет нам ответить на вопрос: есть ли здесь какой-то Разумный Замысел?</p>

  <p>И можем ли мы, люди, узнать этот Замысел с помощью технических средств? Как телескоп направляют на звёзды,
    направить камеру прямо в "духовный мир"? На эти вопросы ищет ответы проект Архитектор.</p>

  <p>Давайте преставим, а что если Бог по своей Воле может управлять работой технической системы (например,
    компьютера), если в этом будет какой-то осознаваемый людьми результат. Так как Бог может всё, то для него нет
    проблем управлять чем-то техническим (Бог управляет всей Вселенной). Вопрос лишь в том - станет ли он управлять,
    захочет ли?</p>

  <blockquote>Представьте себе мир, где Бог по своей Воле зажигает свет в фонарях на улице в городах. Делает это Он
    каждый
    день
    в самое подходящее время, учитывая облачность, световой день, погоду, и даже назревающий романтический момент у
    парочки, сидящей в парке под этими фонарями? Чтобы парень достал кольцо, встал на колени, и в этот момент
    зажигается яркий свет! Бог благославит вас! <br/><br/>Для некоторых это может звучить кощунственно, но если Бог
    действительно Безграничен и Бесконечен, то и такой вариант событий может существовать. Мы не можем никогда
    окончательно узнать всего Бога целиком, это за гранью человеческого разума. Я думаю, что наше будущее и будет
    таким.
  </blockquote>

  <p>В таком мире мы, люди, смогли бы наблюдать Бога в нашей обычной реальности (тут есть этические и религиозные
    вопросы, но не будем пока о них). Если отдельные люди достаточно проявят Бога, то Он проявится для всех на
    земле.</p>

  <p>Так вот Архитектор - исследовательский проект, с помощью которого и будет попытка ответить на вопрос, захочет
    ли и
    станет ли Бог специально поддерживать работу технической системы по своей Воле. Станет ли Он вкладывать свой
    замысел в эту систему по своей Воле?</p>
  </div>
</template>
