<template>
  <div  class="mt-5">
    <h1 class="is-size-4">Запрос во Вселенную / Цифровая молитва</h1>
    <div class="notification is-warning">
      Боюсь, что сторонники традиционных религий будут меня за это ненавидеть, но это очень важная фича проекта.
    </div>

    <p>На сайте есть раздел
      <NuxtLink :to="localePath('pray')">"молитва"</NuxtLink>
      . Там есть специальное поле, в которое человек может написать своё обращение во
      Вселенную. Это может быть любое послание, какое человек пожелает отправить. И в ответ Вселенная может
      откликнуться, и нарисовать картину именно для этого человека в ответ на его обращение.
    </p>

    <p>Текст молитвы никуда не отправляется и не сохраняется, но так как Бог Всеведущ, то он видел, о чём писал туда
      человек. И следующая картина будет заново создана и показана этому человеку, в виде ответа. Если Бог пожелает
      создать для человека определённую картину - он может это сделать. Вопрос, на который сейчас нет ответа - захочет
      ли Бог отвечать.</p>

    <blockquote>
      Один инженер нашего сервиса пробовал цифровую молитву, и несколько раз получал очень впечатляющие результаты.
      Ответ
      на молитву иногда бывает <b>невероятно</b> подходящим.
      <NuxtLink :to="localePath('pray')">Попробуйте</NuxtLink>
    </blockquote>

    <p> Молитвы мы не можем никуда сохранять из этических соображений, но картина попадает в общий список, как
      обычная
      работа. Лишь тот, кто писал молитву, будет знать, что конкретная работа была создана именно для него.</p>

    <p>(как это в коде устроено можно посмотреть тут:
      <a href="https://github.com/artchitector/artchitect/blob/master/soul/core/artchitect/artchitect.go#L77-L79"
         target="_blank">github</a>)
    </p>
  </div>
</template>
