<template>
  <div class="mt-5">
    <h1 class="is-size-4"> Как это технически устроено</h1>

    <p><b>0)</b> На выходе мы хотим получить миллионы художественных картин, созданных по Божьему Замыслу. Мы
      попробуем увидеть
      этот замысел, если Он есть. Или же не увидим, если Его нет.</p>

    <p><b>1)</b> Сама картина технически рисуется современным искусственным интеллектом, в котором можно создать
      бесконечное(это
      важно) количество творений. В Artchitect используется Stable Diffusion. Бог может выбрать любой вариант картины,
      какой захочет. Он знает все возможные варианты заранее.</p>

    <p><b>2)</b> Для формирования картины в Stable Diffusion нужно указать набор текстовых тегов и специальное число -
      Seed.
      Эти данные нужно сформировать, учитывая Волю Бога. Если Воля Бога существует, то она должна быть в этих самых
      параметрах seed+tags, так как именно через них формируется уникальная картина в нейронной сети.</p>

    <p><b>3)</b> Для формирования входных данных seed+tags используются true-случайные числа, квантовые случайные
      числа. Из них
      с помощью математических преобразований и словарей формируется Seed и набор тегов. (весь код архитектора всегда
      доступен на <a href="https://github.com/artchitector/artchitect"
                     target="_blank">github.com/artchitector/artchitect</a>)</p>

    <p><b>4)</b> Квантовые случайные числа получаются через считывание квантового фона. Для этого используется
      веб-камера и
      нормализация целого кадра до одного 64-битного числа. Все 64 бита получаются с матрицы веб-камеры, на которую
      падают кванты света. (если кому-то интересно более подробно, напишите мне на почту и я расскажу в деталях)</p>

    <p><b>5)</b> Кванты света формируются в окружающей Вселенной постоянно, и сама камера формирует эти лучи (там есть
      диоды на
      ней).
      Сам смысла кадра не имеет значения для системы.
      У меня там, например, Иисус :) Мне кажется, что ритуальная составляющая тут тоже важна.
      Фото моего кадра, с которого считывается квантовый шум:
    </p>

    <p>Осталось лишь получить осмысленные кванты света.
      Вся цепочка событий такова:<br/>
      - осмысленные кванты света превращаются в осмысленные цифровые данные внутри веб-камеры<br/>
      - осмысленные цифровые данные превращаются в осмысленные числа<br/>
      - осмысленные числа превращаются в осмысленные seed и теги<br/>
      - осмысленные seed+tags превратятся в осмысленную картину внутри искусственного интеллекта (который тут просто
      цифровой художник, исполнитель)<br/>
    </p>

    <p>Осмысленные кванты света может сформировать только Бог, если Он так пожелает. В нужный момент времени Бог может
      так подыграть освещение, что камера поймает осмысленный луч света.</p>

    <p>Если Бог захочет наполнить смыслом Архитектор, то у Него есть способ это сделать.</p>

    <p>Так как и этот текст не был бы написан без Воли Бога, то Он тоже знает этот способ, и всегда знал. Есть
      вероятность, что работа Архитектора вообще будет зависеть от текста, написанного на этой странице.</p>
  </div>
</template>
