<template>
  <div>
    <div class="notification is-warning">
      Важно: Архитектор лишь основывается на некоторых основных принципах из монотеистических религий, но сам не
      является ни религией, ни чем-то религиозным. Это философско-технический исследовательский проект.
    </div>
    <p>
      Архитектор построен на философской идее, что ни одно событие во Вселенной не является в действительности
      случайным. Каждый атом, каждый электрон, каждый цветок и каждый человек, вообще всё в отдельности и в целом в
      каждом мгновении находится под надзором безграничного и всепроникающего взгляда Всевышнего. Всё под контролем
      Вселенной в каждый момент времени.
    </p>
    <blockquote>
      Разве ты (о, Пророк) не знаешь, что Аллах над любой вещью мощен? <br/>
      <i>(Аль-Бакара (Корова), 106-й аят из 286)</i>
    </blockquote>
    <blockquote>
      Не пять ли малых птиц продаются за два ассария? и ни одна из них не забыта у Бога. А у вас и волосы на голове
      все сочтены. Итак, не бойтесь: вы дороже многих малых птиц.<br/>
      <i>(Евангелие от Луки 12:4 Ст. 4-7)</i>
    </blockquote>
  </div>
</template>
