<i18n>
{
  "en": {
  },
  "ru": {
  }
}
</i18n>
<template>
  <section class="content">
    <h1><img src="/icon64.png" alt="artchitect"/> Artchitect</h1>
    <p class="is-size-5">Автономная творческая машина</p>
    <blockquote>Может ли машина придумать что-то из ничего?
      <br/>Может ли машина наполнить смыслом бессмысленное?
      <br/>Может.
    </blockquote>
    <p>
      <b>Artchitect</b> (далее Архитектор) - это творческая машина, способная самостоятельно творить картины по
      своему собственному замыслу. Для своего непрерывного труда машина черпает вдохновение в естественной энтропии
      Вселенной (в световом фоне), и создаёт все свои работы без вмешательства человека.
    </p>
    <p>
      <b>Архитектор</b> считывает случайные кванты света из окружающего пространства, превращает их в числа, а числа
      затем
      превращает в картину. Каждая картина уникальна и неповторима, так как её действительным источником является уникальное
      и
      неповторимое состояние Вселенной в конкретный момент времени. <b>Архитектор</b> принимает на вход простейшие
      данные,
      "распакованные" из квантов света, а на выходе создаёт комплексную художественную работу с непредсказуемым сюжетом,
      содержанием и стилем. Работу, идея которой могла появиться лишь в этом конкретном месте, времени и состоянии,
      и ни в каком другом.  И так каждые 60 секунд.
    </p>
    <p>
      Подлинным автором каждой картины является уникальная случайность Вселенной, а сама машина <b>Artchitect</b> лишь исполняет
      указания "из ниоткуда". "Несколько дюжин" квантов света могут стать холстом над вашим камином, если к ним присовокупить
      Artchitect с его нейронным мозгом. И не одним холстом, а сотнями и тысячами непохожих друг на друга холстов,
      сотканных из мириад лучей света, пришедших со звёзд. Бесконечное творение, раскрывающее само себя во времени.
    </p>
    <p>
      <b>Архитектор</b> нарисовал уже 250 тысяч картин, и всё это время он старательно ищет ответ на философский вопрос
      "Может ли машина творить?".
    </p>
    <p class="is-size-7">
      В технической основе <b>Архитектора</b> лежит generative AI
      <a href="https://github.com/Stability-AI/stablediffusion" target="_blank">Stable Diffusion</a> v1.5 и
      <a href="https://github.com/invoke-ai/InvokeAI" target="_blank">InvokeAI</a>, именно с их помощью создаются
      комплексные изображения из сырых идей.
      Весь код проекта доступен на <a href="https://github.com/artchitector/artchitect" target="_blank">github</a>.
    </p>
  </section>
</template>
<script>
export default {}
</script>
