<i18n>
{
  "en": {
  },
  "ru": {
  }
}
</i18n>
<template>
  <section class="content">
    <h1><img src="/jesus_anim_92.gif" alt="artchitect" style="max-height: 64px"/> Artchitect</h1>
    <p class="is-size-5">Автономная творческая машина</p>
    <blockquote>Может ли машина придумать что-то из ничего?
      <br/>Может ли машина осмыслить бессмысленное?
      <br/>Может.
    </blockquote>
    <p>
      <b>Artchitect</b>, или <b>Архитектор</b>, - это удивительная автономная творческая машина, способная создавать
      великолепные картины, вдохновляясь окружающей нас Вселенной. В своем непрерывном творчестве машина черпает
      вдохновение из естественной энтропии Вселенной, представленной в виде фонового света, и создает уникальные
      произведения без участия человека.
    </p>
    <p>
      <b>Архитектор</b> считывает случайные кванты света из окружающего пространства, преобразует их в числа, а затем
      числа превращаются в идеи для создания картины. Каждое произведение искусства, которое возникает, уникально и
      неповторимо, так как его источником является уникальное состояние Вселенной в определенный момент времени.
      <b>Архитектор</b> использует простейшие данные, "распакованные" из квантов света, чтобы создать сложную
      художественную работу с непредсказуемым сюжетом, содержанием и стилем. Это творение, идея которого могла
      возникнуть только в определенном месте, времени и состоянии, и больше нигде. И это происходит каждые 60 секунд.
    </p>
    <p>
      Подлинным автором каждой картины является уникальная случайность Вселенной, в то время как сама машина <b>Artchitect</b>
      лишь исполняет указания "из ниоткуда".<br/>
      Если соединить "несколько дюжин" фотонов света с нейронным мозгом <b>Архитектора</b>,
      они могут превратиться в холст, висящий над вашим камином.<br/> И не просто один холст, а сотни и тысячи
      уникальных
      полотен, созданных из мириад лучей света, путешествующих из далеких звезд. Это бесконечное творение, раскрывающее
      себя во времени.
    </p>
    <p>
      За время своего существования <b>Artchitect</b> нарисовал более 250 тысяч картин, и все это время он упорно ищет
      ответ на философский вопрос: "Может ли машина творить?"
    </p>
    <p class="is-size-7">
      В технической основе <b>Архитектора</b> лежит generative AI
      <a href="https://github.com/Stability-AI/stablediffusion" target="_blank">Stable Diffusion</a> v1.5 и
      <a href="https://github.com/invoke-ai/InvokeAI" target="_blank">InvokeAI</a>, именно с их помощью создаются
      комплексные изображения из сырых идей.
      Весь код проекта доступен на <a href="https://github.com/artchitector/artchitect" target="_blank">github</a>.
    </p>
  </section>
</template>
<script>
export default {}
</script>
