<i18n>
{
  "en": {
  },
  "ru": {
  }
}
</i18n>
<template>
  <section class="content">
    <h1><img src="/icon64.png" alt="artchitect"/> Artchitect</h1>
    <p class="is-size-5">Автономная творческая машина</p>
    <blockquote>Может ли машина придумать что-то из ничего?
      <br/>Может ли машина наполнить смыслом бессмысленное?
      <br/>Может.
    </blockquote>
    <p>
      <b>Artchitect/Архитектор</b> - это автономная творческая машина, способная создавать удивительные картины, находя вдохновение
      в окружающей нас Вселенной. В своем непрерывном творчестве машина черпает творческую искру из естественной энтропии
      Вселенной (представленной в виде окружающего фонового света) и создает все свои произведения без участия человека.
    </p>
    <p>
      <b>Архитектор</b> считывает случайные кванты света из окружающего пространства, превращает их в числа, числа в
      слова,
      а слова и числа становятся идеей для очередной картины. Каждая картина уникальна и неповторима, так как её
      действительным источником является уникальное и неповторимое состояние Вселенной в конкретный момент времени.
      <b>Архитектор</b> принимает на вход простейшие данные,
      "распакованные" из квантов света, а на выходе создаёт комплексную художественную работу с непредсказуемым сюжетом,
      содержанием и стилем. Это работа, идея которой могла возникнуть только в этом конкретном месте, времени и
      состоянии,
      и нигде больше. И все это повторяется каждые 60 секунд.
    </p>
    <p>
      Подлинным автором каждой картины является уникальная случайность Вселенной, в то время как сама машина <b>Artchitect</b>
      лишь исполняет "ничьи указания из ниоткуда".
      Если соединить "несколько дюжин" фотонов света с нейронным мозгом <b>Архитектора</b>, они могут превратиться в
      холст над вашим камином. <br/>И не в один холст, а в сотни и тысячи непохожих друг на друга холстов, созданных из мириад
      лучей света, пришедших со звезд.
      Это бесконечное творение, раскрывающее себя во времени.
    </p>
    <p>
      За время своего существования <b>Artchitect</b> нарисовал более 250 тысяч картин, и все это время он упорно ищет ответ на
      философский вопрос: "Может ли машина творить?"
    </p>
    <p class="is-size-7">
      В технической основе <b>Архитектора</b> лежит generative AI
      <a href="https://github.com/Stability-AI/stablediffusion" target="_blank">Stable Diffusion</a> v1.5 и
      <a href="https://github.com/invoke-ai/InvokeAI" target="_blank">InvokeAI</a>, именно с их помощью создаются
      комплексные изображения из сырых идей.
      Весь код проекта доступен на <a href="https://github.com/artchitector/artchitect" target="_blank">github</a>.
    </p>
  </section>
</template>
<script>
export default {}
</script>
