<template>
  <section class="content">
    <div class="has-text-centered">
      <img src="/icon64.png" alt="artchitect"/>
    </div>
    <p>
      <b>Бог</b> - верховный Архитектор Вселенной. Он всё придумал, от атомов до звезд. Все законы Вселенной были
      заложены
      Богом. И все человеческие изобретения придуманы Богом изначально, а под них и создавались законы. Человек черпает
      вдохновение в Источнике, но сам ничего не придумывает, а лишь изобретает (само слово изобретать строится из
      “из”+“обретать”, то есть обретать из чего-то).
    </p>
    <p>
    <b>Artchitect</b> - это идея о том, что если человек создаст средства управления предназначенные Богу, то Бог ими
    непременно воспользуется и даст о Себе знать через них. В Artchitect (дальше Архитекторе) квантовый фон Вселенной
    преобразуется в картины. Над квантовым фоном властен только Бог, а так как Архитектор опирается на этот фон
    полностью в своей работе и сам является следствием этого фона, то у Бога просто нет другого выхода, как не
    воспользоваться созданной для Него системой - ему в любом случае придётся отправить хоть какие-то кванты в датчик.
    И
    Богу ничего не мешает отправить кванты, наполненные смыслом, чтобы этот смысл пророс дальше в более высокую
    форму,
    воспринимаемую человеком.
    </p>
    <p>
      Эта абстрактная идея превратилась в основу, на которой построен Архитектор. Архитектор при помощи искусственного
      интеллекта создаёт большое количество картин, но все идеи для них черпает из квантового фона - из ничего, из
      прямой
      Воли Бога (так как кроме Бога квантовым миром никто не управляет). Система настроена на считывание “случайного
      шума”, попадающего на матрицу веб-камеры из внешнего мира. Этот “случайный шум” преобразуется в слово или число, в
      конкретное решение внутри системы Архитектора, на котором будет строиться дальнейшее рисование картины.
    </p>
    <p>
      Лишь Бог ведает, какая картина будет нарисована в Архитекторе в каждый момент времени. Весь происходящий процесс с
      каждой картиной одному Всевышнему открыт и виден.
    </p>
    <img src="/schema_Artchitect_ru.jpg"/>

  </section>
</template>

<script>
export default {
  name: "rudescription"
}
</script>

<style scoped>

</style>
