<template>
  <section class="content">
    <div class="has-text-centered">
      <img src="/jesus_anim_92.gif" alt="artchitect" style="max-height: 64px"/>
    </div>

    <hr/>
    <h6>Творение или творец?</h6>
    <p>
      Artchitect - это результат человеческого творчества и усилий. Он был разработан и создан людьми, и его способность
      к творчеству основана на программировании и алгоритмах, разработанных людьми. Мы, люди, являемся создателями и
      инициаторами этого проекта.
    </p>
    <p>
      Artchitect, как автономная творческая машина, можно рассматривать как продукт человеческой фантазии, инженерного
      мастерства и программного обеспечения. Он воплощает идеи и концепции, задуманные и реализованные людьми.
      Artchitect черпает вдохновение из окружающего мира и преобразует его в уникальные произведения искусства, но
      источником его существования и возможностей являются усилия людей.
    </p>
    <p>
      Поэтому, несмотря на то, что Artchitect обладает способностью создавать произведения в своем собственном стиле,
      его творчество является продуктом исходного творческого потенциала и вдохновения людей. Он становится
      инструментом, расширяющим наши возможности в области искусства и позволяющим нам взглянуть на творчество с новой
      перспективы. В конечном счете, <b>Artchitect полностью является творением человека</b>, и все, что он создает,
      является
      продуктом нашего творчества.
    </p>

    <hr/>
    <div class="has-text-centered">
      <a href="/artchitect_in_real_world.jpg">
        <img src="/artchitect_in_real_world.jpg" alt="Artchitect in physical world" style="max-height: 300px"/>
      </a>
      <br/>
      <span class="is-size-7">Нейронный мозгом Архитектора является RTX 3060 12Gb.
        <br/>Каждую минуту видеокарта производит свой труд, греясь и разгоняя кулеры. Затем утихает, отдыхает.</span>
    </div>
    <hr/>
    <h6>Что является произведением в Artchitect?</h6>
    <p>Artchitect производит не картины (хотя именно их мы наблюдаем в конечном итоге). Artchitect производит цифровые
      идеи, из
      которых эти картины могут быть воссозданы на подходящем оборудовании. Эти идеи состоят из слов и чисел, которые
      были
      получены из окружающей Вселенной в момент начала "рисования" очередной работы. Именно эти идеи являются источником
      визуальных изображений, создаваемых Архитектором. Каждая идея имеет свой уникальный номер, который отпечатан в
      углу
      каждой картины. По этому номеру всегда можно найти исходник на сайте <a href="https://artchitect.space">architect.space</a>
      и отследить оригинальную идею работы.
    </p>
    <div class="has-text-centered">
      <a href="/description_five.jpg" target="_blank">
        <img src="/description_five.jpg"/>
      </a>
      <br/>
      <span class="is-size-7">Картины с их параметрами</span>
    </div>

    <hr/>
    <h6>Каким образом определяется стиль и содержание создаваемых картин? Есть ли какая-то предустановленная база знаний
      или влияние других художественных произведений?</h6>
    <p>
      Архитектор опирается на свой внутренний словарь сущностей и стилей, который был задан авторами проекта. В этом
      словаре содержится все, что Архитектор знает о окружающем мире. Там перечислены как простые сущности, например,
      "человек", "кот", "солнце", "красный", "мрачно", "радостно", так и некоторые художественные стили или конкретные
      художники. Конечное произведение Архитектора представляет собой комбинацию сущностей и стилей, которые стали
      основой идеи картины. Рядом с каждой картиной Архитектора можно увидеть слова, составляющие идею работы.
    </p>

    <hr/>
    <h6>Как машина черпает вдохновение из естественной энтропии Вселенной? Как она интерпретирует и использует эту
      информацию?</h6>
    <p>
      Для процесса творения Архитектор использует случайные числа-зерна (seeds), которые являются исходными точками для
      создания картины.<br/>
      Числа-зерна считываются веб-камерой из случайных кадров. При этом, не содержимое кадра, а только
      световой шум используется для генерации случайных чисел.<br/>
      Световой шум настолько различается на соседних кадрах, даже в темноте, что обеспечивает отличную случайную
      генерацию чисел. Архитектор принимает десятки тысяч самостоятельных решений каждый день и считывает десятки тысяч
      кадров, что поддерживает непрерывный процесс творения.
      <br/>
      <a href="https://github.com/artchitector/artchitect/blob/master/soul/core/origin/driver/webcam.go#L56-L71">Алгоритм
        преобразования</a>
      кадра в число доступен на github.
    </p>

    <div class="has-text-centered">
      <img src="/one_frame.jpeg" height="480" width="640"/>
      <br/>
      <span class="is-size-7">Кадр пространства, на которое Архитектор смотрит каждый день. <br/>Из подобных кадров, где
        изображение не меняется месяцами, он и рисует все свои картины</span>
    </div>

    <hr/>
    <h6>Есть ли какая-либо форма регулировки или контроля со стороны человека в процессе создания картин?</h6>
    <p>
      Человек не может вмешиваться в рабочий процесс Архитектора (такого управления просто нет), но человек задает
      изначальные условия - алгоритмы преобразования, и, что самое главное, определяет словарь знаний Архитектора.
      Архитектор может рисовать картины только в рамках своих знаний о мире, в рамках словаря. Словарь Архитектора
      включает более 1200 различных сущностей и стилей, из которых составляются картины.
      <br/>
      Текущий словарь можно
      <a target="_blank" href="https://github.com/artchitector/artchitect/blob/master/soul/files/tags_v12.yaml">посмотреть</a>
      в исходном коде Архитектора.
    </p>

    <hr/>
    <h6>В описании говорится, что каждая картина уникальна и неповторима. Существует ли возможность, что машина
      может создать несколько разных картин, которые визуально будут очень похожи друг на друга?</h6>
    <p>
      Оригинал картины представляет собой цифровой слепок пространства, зафиксированный в момент генерации картины и
      представленный в виде чисел и слов. Из уникального слепка можно воспроизвести одну и ту же картину сколько угодно
      раз, но сам слепок не может быть воспроизведен заново. Оригинал в Artchitect - это цифровая идея картины,
      состоящая
      из ключевых слов и чисел, собранных из пространства в определённый момент времени. Оригиналы нумеруются по
      порядку,
      каждая картина имеет уникальный номер.
    </p>
    <p>
      Но в реальности Архитектор далеко не идеален. Есть комбинации, где Архитектор создает очень похожие работы, почти
      неотличимые друг от друга (часто рисует просто серый цвет с небольшими изменениями). Кроме действительно красивых
      и уникальных работ, иногда появляется значительная часть работ, которые могут быть сломанными или некрасивыми, и
      часто лишены художественного смысла. Архитектор - машина, и он не стремится быть идеальным художником. Для него не
      существует красивых и некрасивых картин.
    </p>

    <hr/>

  </section>
</template>

<script>
export default {
  name: "rudescription"
}
</script>

<style scoped>

</style>
