<template>
  <section class="content">
    <div class="has-text-centered">
      <img src="/icon64.png" alt="artchitect"/>
    </div>

    <hr/>
    <h6>Творение или творец?</h6>
    <p>
      Artchitect является результатом человеческого творчества и усилий. Он был разработан и создан людьми, и его
      способность творить основана на программировании и алгоритмах, разработанных людьми. Мы, люди, являемся
      создателями и инициаторами этого проекта.
    </p>
    <p>
      Artchitect, как автономная творческая машина, может быть рассмотрен как продукт человеческой фантазии, инженерных
      умений и программного обеспечения. Он воплощает идеи и концепции, задуманные и воплощенные людьми. Artchitect
      получает свое вдохновение из окружающего мира и преобразует его в уникальные произведения искусства, но источником
      его существования и возможностей являются усилия людей.
    </p>
    <p>
      Поэтому, несмотря на то, что Artchitect обладает способностью рисовать в своем собственном стиле, его творчество
      является продуктом исходного творческого потенциала и вдохновения людей. Он становится инструментом, расширяющим
      наши возможности в области искусства и позволяющим нам взглянуть на творчество с новой перспективы, но в конечном
      счёте <b>Artchitect сам полностью является творением человека</b>, вместе со всем тем, что им будет создано.
    </p>

    <hr/>
    <h6>Есть ли какая-либо форма регулировки или контроля со стороны человека в процессе создания картин?</h6>
    <p>
      Человек не может вмешиваться в рабочий процесс Архитектора (такого управления просто нет), но человек задаёт
      изначальные условия - алгоритмы преобразования, и, что самое главное, человек определяет словарь знаний
      Архитектора. Архитектор может рисовать картины только в рамках своих знаний о мире, в рамках словаря.
      Словарь Архитектора состоит из более 1200 разных сущностей и стилей, из которых собираются картины.
      <br/>
      Текущий словарь можно
      <a target="_blank" href="https://github.com/artchitector/artchitect/blob/master/soul/files/tags_v12.yaml">посмотреть</a>
      в исходном коде Архитектора.
    </p>


    <hr/>
    <h6>Каким образом определяется стиль и содержание создаваемых картин? Есть ли какая-то предустановленная база знаний
      или влияние других художественных произведений?</h6>
    <p>
      Архитектор опирается на свой внутренний словарь сущностей и стилей, заданный авторами проекта. Сущности в этом
      словаре -
      всё, что Архитектор знает об окружающем мире. Там перечисленны как простые сущности вроде
      "человек, кот, солнце, красный, мрачно, радостно", так и некоторые художественные стили или конкретные художники.
      Конечная работа Архитектора - это комбинация сущностей и стилей, лёгших в основу идеи картины. Вы можете увидеть
      слова, составляющие идею, рядом с каждой картиной Архитектора.
    </p>

    <hr/>
    <h6>Как машина черпает вдохновение из естественной энтропии Вселенной? Как она интерпретирует и использует эту
      информацию?</h6>
    <p>Для процесса творения Архитектор использует случайные числа-зёрна (seeds), из которых, как из ростков, прорастёт
      картина.
      <br/>Числа-зёрна считываются веб-камерой из случайных кадров. В учёт принимается не сам кадр и его содержимое,
      а
      лишь световой шум. Световой шум настолько отличается на соседних кадрах даже в темноте, что даёт отличную
      случайную
      генерацию чисел.
      <br/>
      Архитектор принимает десятки тысяч самостоятельных решений каждый день, и считывает десятки тысяч кадров.
      Так он и поддерживает непрерывный процесс творения.<br/>
      <a href="https://github.com/artchitector/artchitect/blob/master/soul/core/origin/driver/webcam.go#L56-L71">Алгоритм
        преобразования</a>
      кадра в число доступен на github.

    <div class="has-text-centered">
      <img src="/one_frame.jpeg" height="480" width="640"/>
      <br/>
      <span class="is-size-7">Кадр пространства, на которое Архитектор смотрит каждый день. <br/>Из подобных кадров, где
        изображение не меняется месяцами, он и рисует все свои картины</span>
    </div>

    <hr/>
    <h6>В описании говорится, что каждая картина уникальна и неповторима. Однако, существует ли возможность, что машина
      может создать несколько разных картин, которые визуально будут очень похожи друг на друга?</h6>
    <p>
      Оригинал картины не изображение, а цифровой слепок пространства, зафиксированный на момент времени генерации картины и
      представленный в виде чисел и слов. Из уникального слепка можно воспроизводить одну и ту же картину сколько угодно раз,
      но сам слепок не может быть воспроизведён заново.
    </p>
    <p>
      Но в реальности Архитектор далеко не идеален. Есть комбинации, где Архитектор рисует очень похожие работы, почти
      не
      отличимые друг от друга (часто рисует просто серый цвет с небольшими изменениями). Кроме действительно красивых и
      уникальных работ попадается ощутимая часть сломанных и некрасивых работ, часто не имеющих никакого художественного
      смысла. Архитектор не пытается быть идеальным художником. Если бы живые художники рисовали по 1400 картин
      каждый день, наверное и у них бы случались такие ошибки.
    </p>

    <hr/>

  </section>
</template>

<script>
export default {
  name: "rudescription"
}
</script>

<style scoped>

</style>
