<i18n>
{
  "en": {
    "title": "Artchitect - idea"
  },
  "ru": {
    "title": "Artchitect - идея"
  }
}
</i18n>
<template>
  <section class="content">
    <h1><img src="/icon64.png" alt="artchitect"/> Artchitect</h1>
    <p class="is-size-5">
      🖌 Цифровой творец
    </p>
    <blockquote>
      Произведение искусства - это не просто сочетание красок, форм и линий, это - целое, имеющее свою душу и
      значение.<br/>
      <span class="is-size-7">*ChatGPT про Artchitect</span>
    </blockquote>
    <p>
      Архитектор - цифровой творец, способный создавать картины <a class="hashed" href="#autonomous">без участия
      людей</a>.
    </p>
    <p>
      Основой самостоятельности Архитектора является квантовый генератор случайных
      чисел. Архитектор использует световой шум Вселенной, чтобы создавать последовательности чисел, которые
      становятся идеей, сюжетом, цветами, стилем и конкретным вариантом каждой картины.
      <a class="hashed" href="#origins">Первоисточники картин</a> (цифровые
      слепки) хранятся в галерее https://artchitect.space рядом с каждой картиной.</p>
    <p>
      Artchitect создаёт свои творения из особого материала - квантовой случайности и сложности
      Вселенной. Он создает одну картину в минуту и более тысячу картин каждый день. И хотя каждая картина может
      быть реплицирована бесконечное число раз, их источник - квантовые идеи - остаются уникальными и неповторимыми.
      Они возникли только один раз в нужное время и в нужном месте.
    </p>
    <p>
      Для создания всех картин используется Stable Diffusion v1.5.
    </p>

    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#autonomous">Автономность</a></h4>
    <div class="mb-4" v-if="opened.autonomous">
      <p>
        Artchitect задуман, как полностью самостоятельная система и работает без вмешательства человека,
        создавая по одной картине каждую минуту, а общее количество работ составляет более 1300 штук каждый день.
      </p>
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#common">Знания, навыки, идеи</a></h4>
    <div class="mb-4" v-if="opened.common">
      <p>
        Знание, навыки, идеи - требования к Архитектору для создания картин. Для создания картины
        необходимы знания о сущностях окружающего мира, идеи для генерации новых сочетаний и навыки по реализации
        этих идей в конечном изображении.
      </p>
    </div>

    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#draw">Навыки Архитектора - Рисование</a>
    </h4>
    <div class="mb-4" v-if="opened.draw">
      <p>
        Однако при использовании искусственного интеллекта, который способен рисовать, по-прежнему не обойтись без опыта человека.
        ИИ (напр. StableDiffusion или Midjourney) способен рисовать по заданным параметрам, но не может придумывать новые идеи
        и слова, как и не может самостоятельно мотивироваться к творчеству. Чтобы избежать использования человеческого фактора и,
        при этом, дать ИИ мотивацию и идеи для рисования, архитектор использует "подсознание" и "память".
      </p>
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#subconscious">Идеи Архитектора -
      Подсознание</a></h4>
    <div class="mb-4" v-if="opened.subconscious">
      <p>
        Квантовый генератор случайных чисел является источником "подсознания" в мозгу архитектора, который  раздражает
        ИИ квантовым фоном и служит источником случайных мыслей. Случайный квантовые мысли используются для принятия
        всех решений в работе Архитектора.
      </p>
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#memory">Знания Архитектора - Память</a>
    </h4>
    <div class="mb-4" v-if="opened.memory">
      <p>
        Архитектор использует свой словарь, который представляет собой текстовый файл с понятиями из окружающего мира
        ("имена всех вещей"). Список слов на (<a href="https://raw.githubusercontent.com/artchitector/artchitect/master/soul/files/tags_v12.yaml"
                                                 target="_blank">github</a>). Из словаря
        извлекаются требуемые сущности, используемые для создания картины, а источником выбора являются случайные
        квантовые мысли.
        <br/><br/>
        Словарь  вместе с обученной моделью Stable Diffusion v1.5 определяет визуальный стиль и сюжеты всех работ Архитектора.
        Расширение словаря ведет к увеличению знаний и повышению разнообразия картин.
      </p>
    </div>
  </section>
</template>

<script>
export default {
  name: "idea",
  head() {
    return {
      title: this.$t('title')
    }
  },
  data() {
    return {
      opened: {
        autonomous: false,
        common: false,
        memory: false,
        draw: false,
        subconscious: false,
        quantum: false,
        origins: false,
        quinta_essentia: false
      }
    }
  },
  methods: {
    infoClick(e) {
      const tag = e.target.href.split('#')[1]
      this.opened[tag] = !this.opened[tag]
      window.ro = this.$route
      // this.$route.hash = tag
    }
  }
}
</script>

<style scoped>
a.hashed {
  color: #4a4a4a;
  text-decoration: underline;
  text-decoration-style: dashed;
}
</style>
