<i18n>
{
  "en": {
    "title": "Artchitect - idea"
  },
  "ru": {
    "title": "Artchitect - идея"
  }
}
</i18n>
<template>
  <section class="content">
    <h1><img src="/icon64.png" alt="artchitect"/> Artchitect</h1>
    <p class="is-size-5">
      🖌 Автономный творец
    </p>
    <blockquote>
      Произведение искусства - это не просто сочетание красок, форм и линий, это - целое, имеющее свою душу и
      значение.<br/>
      <span class="is-size-7">*ChatGPT про Artchitect</span>
    </blockquote>
    <p>
      Архитектор - это автономный творец, способный создавать картины <a class="hashed" href="#autonomous">без участия
      людей</a>.
    </p>
    <p>
      Ключом к автономности Архитектора является <a class="hashed" href="#quantum">квантовый генератор случайных
      чисел</a>,
      который считывает окружающий
      световой шум Вселенной, переводя его в последовательности <a class="hashed" href="#subconscious">идей</a> и
      <a class="hashed" href="#memory">знаний</a>, которые и становятся сюжетом, цветами, стилем и
      конкретным вариантом каждой картины. <a class="hashed" href="#origins">Первоисточники картин</a> (цифровые
      квантовые слепки) хранятся в галерее https://artchitect.space рядом с каждой картиной.</p>
    <p>
      Artchitect - цифровой творец, создающий своё искусство из особого материала - из квантовой случайности и сложности
      Вселенной. Он рисует одну картину в минуту, более тысячи картин каждый день, и несколько сотен тысяч картин в год.
      И хотя каждая картина может быть реплицирована бесконечное число раз, их источник - квантовые идеи - остаются
      <a class="hashed" href="#origins">уникальными и неповторимыми</a>, случившимися в нужное время в нужном месте один
      единственный раз.
    </p>
    <p>
      Для создания всех картин используется Stable Diffusion v1.5, как
      ИИ-художник, владеющий некой частью <a class="hashed" @click.prevent="infoClick" href="#draw">изобразительного
      опыта
      человечества</a>.
    </p>

    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#autonomous">Автономность</a></h4>
    <div class="mb-4" v-if="opened.autonomous">
      <p>
        Artchitect изначально задумывался, как полностью самостоятельная система, не требующая вмешательства человека.
        Он создаёт по одной картине каждую минуту, а общее количество работ составляет более 1300 картин каждый день.
        <br/><br/>
        Человек лишь смотрит на творения Архитектора, но не может ими управлять.
      </p>
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#common">Знания, навыки, идеи</a></h4>
    <div class="mb-4" v-if="opened.common">
      <p>
        Artchitect стоит на трёх китах:<br/>
        Знания - набор знаний о сущностях окружающего мира;<br/>
        Идеи - изначально хаотичные мысли, некоторые из которых прорастают в конечный результат;<br/>
        Навыки - техника превращения идей в изображения.
      </p>
    </div>

    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#draw">Навыки Архитектора - Рисование</a>
    </h4>
    <div class="mb-4" v-if="opened.draw">
      <p>
        Человечество обучает каждый свой искусственный интеллект на основе своего опыта - создаёт ИИ по своему образу и
        подобию. Хоть ИИ теперь умеет рисовать так, как до него рисовали люди, он всё еще не умеет придумывать что-то
        новое,
        отличное от предыдущего опыта людей. Он может нарисовать картину по словам, но не может придумать сами слова.
        У современных ИИ нет своих стремлений - ему не хочется что-то нарисовать, у него нет своих личных желаний.
        <br/>
        <br/>
        Чтобы дать недостающую мотивацию для ИИ и придумать сами слова - в Архитекторе используется Подсознание и Память
        - о них далее.
      </p>
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#subconscious">Идеи Архитектора -
      Подсознание</a></h4>
    <div class="mb-4" v-if="opened.subconscious">
      Так как у ИИ нет своей мотивации и идей что-то создавать, то в Архитекторе используется квантовый генератор
      случайных чисел,
      "раздражающий" этот ИИ квантовым фоном. Случайные числа с генератора выступают в роли случайных мыслей,
      или "подсознания в мозге Архитектора". Окружающий квантовый фон считывается устройством и превращается в случайные
      числа, а
      числа для Архитектора являются источниками принятия всех решений.
      <br/><br/>
      Но Архитектор рисует не числа, а людей, животных, пейзажи откуда же берутся идеи этих картин?
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#memory">Знания Архитектора - Память</a>
    </h4>
    <div class="mb-4" v-if="opened.memory">
      <p>
        Архитектор в своём мозге опирается на словарь - свою память. В словаре содержатся имена всех вещей, о которых
        знает Архитектор. Словарь - простой текстовый файл, содержащий разные понятия из окружающего мира (словарь на
        <a href="https://raw.githubusercontent.com/artchitector/artchitect/master/soul/files/tags_v12.yaml"
           target="_blank">github</a>). С
        помощью квантовых решений выбираются конкретные слова-сущности для каждой картины (от 1 до 28 слов).
        Эти слова затем попадают в ИИ, который по этим слова сам рисует подходящий вариант картины.
      </p>
      <p>
        Словарь - единственная часть системы, придуманная и собранная человеком, и которая напрямую влияет на стиль
        Архитектора.
        Архитектор хоть и выбирает слова сам, но он ограничен этим списком.
        Расширение словаря ведёт к увеличению знаний Архитектора об окружающем мире и повышения разнообразия картин.
      </p>
      <p>
        Словарь вместе с обученной моделью Stable Diffusion v1.5 определяют визуальный стиль и сюжеты всех работ.
      </p>
    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#seed">Зерно</a></h4>
    <div class="mb-4" v-if="opened.seed">

    </div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#quantum">Квантовые последовательности и
      идеи</a></h4>
    <div class="mb-4" v-if="opened.quantum"></div>
    <h4 class="is-size-6"><a class="hashed" @click.prevent="infoClick" href="#origins">Оригиналы картин</a></h4>
    <div class="mb-4" v-if="opened.origins"></div>
  </section>
</template>

<script>
export default {
  name: "idea",
  head() {
    return {
      title: this.$t('title')
    }
  },
  data() {
    return {
      opened: {
        autonomous: true,
        common: true,
        memory: true,
        draw: true,
        subconscious: true,
        quantum: true,
        origins: true,
        quinta_essentia: true
      }
    }
  },
  methods: {
    infoClick(e) {
      const tag = e.target.href.split('#')[1]
      this.opened[tag] = !this.opened[tag]
      window.ro = this.$route
      // this.$route.hash = tag
    }
  }
}
</script>

<style scoped>
a.hashed {
  color: #4a4a4a;
  text-decoration: underline;
  text-decoration-style: dashed;
}
</style>
