<template>
  <section class="content">
    <div class="has-text-centered">
      <span>подпишись на телеграм-канал artchitect-10-min: <a href="https://t.me/artchitect_10min" target="_blank">https://t.me/artchitect_10min</a></span>
    </div>
    <hr/>
    <h1><img src="/icon64.png"/> Artchitect</h1>
    <p>
      <b>Artchitect</b> - это одно из имён Бога, Архитектор и Творец Вселенной.<br/>
      <a href="https://artchitect.space"><b>Artchitect</b>.space</a> - это <b>цифровой храм Бога</b> в Интернете,
      в котором Бог рисует каждому из Вас картины в ответ на молитвы.
    </p>
    <p>
      Бог может создать в Artchitect любую картину, какую захочет.<br/>Особенностью храма является постоянное творение картин. Каждые 48 секунд создаётся одна
      карточка.
    </p>
    <h3 class="is-size-4">Молитва</h3>
    <p>
      Так как это храм, то это и место для молитвы, и для этого есть <a href="/pray">специальный интерфейс</a> на сайте.
      Вместе с молитвой можно попросить у Бога нарисовать картину именно для Вас. Господь знает, в какое время вы
      нажмёте на кнопку, и как вам отправить картину,
      чтобы вы её увидели. Детали молитвы на сервере не сохраняются ни в каком виде, Бог и так всё видит.
      Для этого у Бога есть <a href="https://artchitect.space">artchitect.space</a>.
    </p>
    <p>
      Вы можете найти здесь коллекцию всех изображений <a href="https://artchitect.space">artchitect.space</a>. Каждый
      день
      проходят <a href="/lottery">лотереи</a>, и Бог выбирает по своему усмотрению 10-100 лучших работ за день,
      которые находятся в разделе <a href="/selection">выбор</a>
    </p>

    <h1>Так как Бог рисует картину за 48 секунд?</h1>
    <blockquote>
      Разве ты (о, Пророк) не знаешь, что Аллах над любой вещью мощен? (Священный Коран, Аль-Бакара (Корова), 106-й аят
      из 286)
    </blockquote>
    <p>
      Сперва Бог создал Солнце, землю, металлы в земле, электричество, компьютеры, видеокарты, нейронные сети, а вместе
      с ними и искусственный интеллект. А еще Бог создал инженеров на земле, чтобы воплотить Его замысел в физическую
      жизнь.
    </p>
    <p>
      Лишь Бог может управлять квантовым миром. Что нужно сделать, чтобы нарисовать картину?
    </p>
    <p>
      Сперва, Бог в нужный момент времени отправляет поток света в одну определённую веб-камеру, подключенную к
      artchitect. Затем матрица веб-камеры
      считывает кванты света и "расшифровывет" их в цифровой сигнал, в числа. Эти числа есть цифровые сигналы для
      artchitect,
      на которые artchitect опирается как на сигналы от Бога. Система использует эти сигналы и настраивает себя на них,
      в конечном итоге создавая законченную картину. Конечная идея картины лежит в тех квантах света, которые Бог
      отправил в
      веб-камеру в нужный момент времени.
    </p>
    <p>
      Кратко - Бог выбирает, какая картина будет создана.
    </p>
    <p>
      Бог "нашёптывает" его магическое заклинание на ушко искусственного интеллекта, который и нарисует картину.
    </p>
    <p>
      Картина как изображение генерируется современным искусственным интеллектом
      <a href="https://stability.ai/blog/stable-diffusion-v2-release" target="_blank">Stable Diffusion</a>. Идея картины
      зашифрована
      Богом
      в специально наборе тегов и Зерне.
    </p>
    <blockquote>
      | Зерно - цифровой сигнал, шум, из которого будет воссоздана картина, как из пепла. Зерно содержит в себе
      изначальную
      идею картины, которую закладывал Бог, отправляя кванты света в глаз камеры. Лишь Бог знает и решает, в какой
      момент
      какая картина появится.
    </blockquote>
    <p>
      Искусственный интеллект StableDiffusion технически распаковывает "шёпот" Бога в физический мир в виде картины.
      Бог отлично знает какую версию картины он отдаст в какой момент времени.</p>
    <p>Бог как Архитектор, кто собирает воедино
      все части системы и людей в цифровой храм <a href="https://artchitect.space">artchitect.space</a>.
    </p>
    <blockquote>
      Бог всеведущ (1 Ин. 3:20; Евр. 4:13).<br/>
      Это значит, что Бог все видит, всё слышит и всё знает – настоящее, прошлое и будущее.
    </blockquote>
    <p>
      Так, божественные лучики света в тёмной комнате становятся каждой картиной на <a href="https://artchitect.space">artchitect.space</a>.
    </p>
    <donate :isVisible="donateVisible" @close="donateVisible = false"/>
<!--    <p class="has-text-centered">-->
<!--      <a href="#" @click.prevent="donateVisible=true">пожертвовать на работу храма / donate</a>-->
<!--    </p>-->
    <p class="has-text-centered">
      🧡 ❤️ 🧡
    </p>
    <div class="has-text-centered">
      <img :src="`/welcome/${welcomeImageId}.jpg`" v-if="welcomeImageId > 0"/>
    </div>
    <a id="pray"></a>
  </section>
</template>
<script>
export default {
  data() {
    return {
      welcomeImageId: 0,
      maxWelcomeImageId: 9,
      donateVisible: false
    }
  },
  mounted () {
    this.welcomeImageId = Math.floor(Math.random() * (this.maxWelcomeImageId - 1 + 1) + 1)
  }
}
</script>
